[
    {
      "id": 1,
      "title": "Resume Builder & Interview Prep Tool",
      "shortDescription":"A powerful tool to simplify job applications, allowing users to create professional resumes with customizable templates and prepare for interviews with AI-driven, role-specific practice sessions.",
      "fullDescription": "The Resume Builder & Interview Prep Tool is a comprehensive platform designed to enhance job application processes. Users can create visually appealing, professional resumes using customizable templates that suit various job profiles. The tool also offers an AI-driven interview preparation feature, tailored to specific job roles, helping users practice commonly asked questions and develop effective responses. Built with HTML, CSS, JavaScript, Python, Django, and MySQL, this project combines both frontend and backend development skills to deliver a seamless, user-friendly experience that prepares candidates to stand out in competitive job markets.",
      "image": "project1.png",
      "url": "https://github.com/ChiFungHillmanChan/Resume-builder-and-interview-prep",
      "category": "fullstack",
      "sourceCode":"https://github.com/ChiFungHillmanChan/Resume-builder-and-interview-prep",
      "liveDemo":"dashboard-demo.mp4",
      "technologies":["HTML", "CSS", "JavaScript", "Python", "Django", "MySQL"]
    },
    {
      "id": 2,
      "title": "Programming Practice",
      "shortDescription":"Explore my programming practice repository to find diverse project files in various languages, showcasing my skills and versatility. Dive in and see my work across multiple programming disciplines.",
      "fullDescription": "Welcome to my programming practice repository, where I showcase a variety of project files crafted across different programming languages. This collection represents my ongoing journey in software development, with each project highlighting unique skills and techniques. From web development and data science to algorithms and system design. Such as leetcode project, to full stack practice. This repository offers a glimpse into my technical growth and adaptability. Feel free to browse through each folder to see the practical applications of different languages, tools, and frameworks – your insights and feedback are always welcome!",
      "image": "program_practice.jpeg",
      "url": "https://github.com/ChiFungHillmanChan/programming-project",
      "category": "program",
      "sourceCode":"https://github.com/ChiFungHillmanChan/programming-project",
      "liveDemo":"no-demo",
      "technologies":["HTML", "CSS", "JavaScript", "Python", "Django", "Flask", "MySQL", "React.js", "Java", "Pygame" ]
    },
    {
      "id": 3,
      "title": "Coming Soon",
      "shortDescription": "This project demonstration will come soon",
      "fullDescription":"This project demonstration will come soon",
      "image": "coming_soon.png",
      "url": "https://github.com/ChiFungHillmanChan/",
      "category": "none",
      "sourceCode":"https://github.com/ChiFungHillmanChan/",
      "liveDemo":"",
      "technologies":[]
    }
  ]